Clash Bot Observability Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot-Obs/runs/run-NKyddGaNhsY9C4r6

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
data.tfe_outputs.clash-bot-discord-bot: Reading...
data.tfe_outputs.clash-bot-discord-bot: Read complete after 0s [id=ClashBot-ClashBot]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.clash_bot_error_cloudwatch_filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "clash_bot_error_cloudwatch_filter" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{$.level = 50}"
      + id              = (known after apply)
      + log_group_name  = "clash-bot-webapp-ecs-task-logs"
      + name            = "error_event_service"
      + role_arn        = (known after apply)
    }

  # aws_iam_policy.cloudwatch_iam_policy will be created
  + resource "aws_iam_policy" "cloudwatch_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-cloudwatch-lambda-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Observability"
        }
    }

  # aws_iam_role.clash-bot-obs-lambda-role will be created
  + resource "aws_iam_role" "clash-bot-obs-lambda-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-obs-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Observability"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs-ecr-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ecr-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-obs-lambda-role"
    }

  # aws_lambda_alias.clash_bot_notification_lambda_alias will be created
  + resource "aws_lambda_alias" "clash_bot_notification_lambda_alias" {
      + arn              = (known after apply)
      + description      = "A version of the Clash Bot Notification Lambda."
      + function_name    = (known after apply)
      + function_version = "PR-Build"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "Clash_Bot_Notification_Alias"
    }

  # aws_lambda_function.clash_bot_notification_lambda will be created
  + resource "aws_lambda_function" "clash_bot_notification_lambda" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "Used to publish error logs to the LoL-ClashBotSupport Discord server."
      + function_name                  = "clash-bot-obs-function"
      + id                             = (known after apply)
      + image_uri                      = (sensitive)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Observability"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DISCORD_WEBHOOK_URL" = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (sensitive)
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function_event_invoke_config.clash_bot_func_event_config will be created
  + resource "aws_lambda_function_event_invoke_config" "clash_bot_func_event_config" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 2
    }

  # aws_lambda_permission.log_event_trigger_permission will be created
  + resource "aws_lambda_permission" "log_event_trigger_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "clash-bot-obs-function"
      + id                  = (known after apply)
      + principal           = "logs.us-east-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:us-east-1:816923827429:log-group:/clash-bot-*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.clash-bot-lambda-sg will be created
  + resource "aws_security_group" "clash-bot-lambda-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (sensitive)
      + name                   = "clash-bot-obs-lambda-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Observability"
        }
      + vpc_id                 = (sensitive)
    }

Plan: 9 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @Poss111, Action: `pull_request`*